Revit 2027 API
TessellatedShapeBuilder.LogInteger Property
 Integer value used for logging, if it is performed. Usually the number of the face set(s) in the IFC file, from which they are imported. Any value is acceptable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int LogInteger { get; set; }
Public Property LogInteger As Integer
	Get
	Set
public:
property int LogInteger {
	int get ();
	void set (int value);
}
member LogInteger : int with get, set
Property Value
Int32
See Also
Reference
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace